In [1]:
import pandas as pd
df = pd.DataFrame({"Name":["Tejas", "Nas", "Pat"], "Age":[20, 21, 22],
"Sub1":[90, 80, 70], "Sub2":[80, 70, 60], "Team": ['A', 'B', 'A']})
print(df.head())

    Name  Age  Sub1  Sub2 Team
0  Tejas   20    90    80    A
1    Nas   21    80    70    B
2    Pat   22    70    60    A

In [2]:
print(df.loc[0:1])

    Name  Age  Sub1  Sub2 Team
0  Tejas   20    90    80    A
1    Nas   21    80    70    B

In [3]:
c=df.groupby("Team")
c.get_group("A")

    Name  Age  Sub1  Sub2 Team
0  Tejas   20    90    80    A
2    Pat   22    70    60    A

In [4]:
print(df.aggregate({"Sub1":["sum"]}))

     Sub1
sum   240

In [5]:
df["Total"] = df["Sub1"]+df["Sub2"]
df["Total"]

0    170
1    150
2    130
Name: Total, dtype: int64

In [6]:
df.drop("Total", axis = 1, inplace=True)
df.head()

    Name  Age  Sub1  Sub2 Team
0  Tejas   20    90    80    A
1    Nas   21    80    70    B
2    Pat   22    70    60    A

In [7]:
df.isnull()
df.fillna(0)

    Name  Age  Sub1  Sub2 Team
0  Tejas   20    90    80    A
1    Nas   21    80    70    B
2    Pat   22    70    60    A

In [8]:
df1 = pd.DataFrame({"Name":['A', 'B', 'C'], "ID":[1, 2, 3]})
df2 = pd.DataFrame({"ID":[2, 3, 4], "Sub":["Math", "Phy", "Chem"]})
df1.head()

  Name  ID
0    A   1
1    B   2
2    C   3

In [9]:
df1.head()

  Name  ID
0    A   1
1    B   2
2    C   3

In [10]:
df2.head()

   ID   Sub
0   2  Math
1   3   Phy
2   4  Chem

In [11]:
df1.merge(df2,on="ID", how="inner")

  Name  ID   Sub
0    B   2  Math
1    C   3   Phy